Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: If you would like to test any of the examples in this section, you can cut and paste the examples and insert the following line to see for yourself what 's going on:
pt_br: Para mais informações sobre esta conversão, veja página do manual UNIX de strtod( 3).

source: Do not expect to get the code of one character by converting it to integer (as you would do in C for example).
pt_br: Se você deseja testar qualquer um dos exemplo dessa seção, você pode copiar e colar os exemplos e inserir as linhas seguintes para ver por si mesmo como isso funciona.

source: Use the functions ord() and chr() to convert between charcodes and characters.
pt_br: echo "\$foo==$foo; tipo". gettype ($foo). "br / \n";

source: That is to say, if you assign a string value to variable $var, $var becomes a string.
pt_br: O PHP não requer (ou suporta) a definição de tipo explicita na declaração de variáveis: o tipo de uma variável é determinado pelo contexto em que a variável é utilizada.

source: If you then assign an integer value to $var, it becomes an integer.
pt_br: Isto significa que, se você assimila um valor string para a variável var, var se torna uma string.

source: An example of PHP' s automatic type conversion is the addition operator '+ '.
pt_br: Se você então assimila um valor inteiro para var, ela se torna um inteiro.

source: If any of the operands is a float, then all operands are evaluated as floats, and the result will be a float.
pt_br: Um exemplo da conversão automática do PHP é o operador de adição '+'.

source: Otherwise, the operands will be interpreted as integers, and the result will also be an integer.
pt_br: Se qualquer um dos operadores for float, então todos os operadores são avaliados como floats, e o resultado será um float.

source: Note that this does NOT change the types of the operands themselves; the only change is in how the operands are evaluated.
pt_br: De outra forma, se os operadores forem interpretados como inteiros então o resultado será um inteiro.

source: ?php $foo = "0"; / / $foo is string (ASCII 48) !- - bad example, no real operator (must be used with variable, modifies it too) $foo++; / / $foo is the string "1" (ASCII 49) - - $foo += 2; / / $foo is now an integer (2) $foo = $foo + 1.3; / / $foo is now a float (3.3) $foo = 5 + "10 Little Piggies"; / / $foo is integer (15) $foo = 5 + "10 Small Pigs"; / / $foo is integer (15) !- - TODO: explain ++ / - - behaviour with strings examples: ++'001 '= '002' ++'abc '= 'abd' ++'xyz '= 'xza' ++'9.9 '= '9.0' ++'-3 '= '-4' - -'9 '= 8 (integer!) - -'5.5' = '5.5 '- -'-9' = -10 (integer) - -'09 '= 8 (integer) - -'abc' = 'abc '- -?
pt_br: $foo = "0"; / / $foo é string (ASCII 48) $foo += 2; / / $foo é agora um inteiro (2) $foo = $foo + 1.3; / / $foo é agora um float (3.3) $foo = 5 + "10 Little Piggies"; / / $foo é inteiro (15) $foo = 5 + "10 Small Pigs"; / / $foo é inteiro (15)

source: If the last two examples above seem odd, see String conversion to numbers.
pt_br: Se os últimos dois exemplos lhe parecerem estranhos, veja Conversão de strings.

source: If you wish to force a variable to be evaluated as a certain type, see the section on Type casting.
pt_br: Se você deseja forçar uma variável para ser avaliada como um certo tipo, veja a seção Moldando o tipo (casting).

source: If you wish to change the type of a variable, see settype().
pt_br: Se você deseja mudar o tipo de uma variável, veja settype().

source: If you would like to test any of the examples in this section, you can use the var_dump() function.
pt_br: Se quiser testar qualquer um dos exemplo desta seção, você pode usar a função var_dump().

source: The behaviour of an automatic conversion to array is currently undefined.
pt_br: O comportamento de uma conversão automática para array é atualmente indefinida.

source: ?php $a = "1"; / / $a is a string $a[0] = "f"; / / What about string offsets?
pt_br: $a = "1"; / / $a é uma string $a[0] = "f"; / / E com relação aos índices da string?

source: What happens??
pt_br: O que acontece?

source: Since PHP (for historical reasons) supports indexing into strings via offsets using the same syntax as array indexing, the example above leads to a problem: should $a become an array with its first element being "f", or should "f "become the first character of the string $a?
pt_br: Desde que o PHP suporta indexação de strings através de offsets utilizando a mesma sintaxe da indexação de arrays, o exemplo acima nos deixa um problema: $a se tornou um array sendo o primeiro elemento "f", ou será que "f" se tornou o primeiro caracter da string $a?

source: The current versions of PHP interpret the second assignment as a string offset identification, so $a becomes "f", the result of this automatic conversion however should be considered undefined.
pt_br: Correções, entretanto, estão sendo discutidas.

source: ?php $a = "abc"; / / $a is a string $a{1} = "f"; / / $a is now "afc"?
pt_br: A moldagem de tipos no PHP funciona como no C: o nome de um tipo desejado é escrito entre parênteses antes da variável em que se deseja a moldagem.

source: Type casting in PHP works much as it does in C: the name of the desired type is written in parentheses before the variable which is to be cast.
pt_br: As moldagens permitidas são:

source: ?php $foo = 10; / / $foo is an integer $bar = (boolean) $foo; / / $bar is a boolean?
pt_br: (bool), (boolean) - molde para booleano

source: The casts allowed are:
pt_br: (float), (double), (real) - molde para número de ponto flutuante

source: (int), (integer) - cast to integer
pt_br: (string) - molde para string

source: (bool), (boolean) - cast to boolean
pt_br: (array) - molde para array

source: (float), (double), (real) - cast to float
pt_br: Nota:

source: (array) - cast to array
pt_br: Em vez de moldar uma variável para string, você também pode circundar a variável entre aspas.

source: Note that tabs and spaces are allowed inside the parentheses, so the following are functionally equivalent:
pt_br: $foo = (int) $bar; $foo = (int) $bar;

source: Instead of casting a variable to string, you can also enclose the variable in double quotes.
pt_br: Convertendo para booleano

source: ?php $foo = 10; / / $foo is an integer $str = "$foo"; / / $str is a string $fst = (string) $foo; / / $fst is also a string / / This prints out that "they are the same "if ($fst === $str) {echo "they are the same";}?
pt_br: Quando moldando ou forçando a conversão de um array para string, o resultado será a palavra Array.

source: It may not be obvious exactly what will happen when casting between certain types.
pt_br: Quando moldando ou forçando o tipo de um objeto para string, o resultado será a palavra Object.

source: Converting to boolean
pt_br: Quando moldando de uma variável escalar ou string para um array, a variável se torna o primeiro elemento do array:

source: Converting to float
pt_br: $var = 'ciao'; $arr = (array) $var; echo $arr[0]; / / outputs 'ciao'

source: Converting to array
pt_br: Quando moldando de uma variável escalar ou string para um objeto, a variável se torna um atributo do objeto: o nome do atributo se chamará 'scalar':

source: Converting to resource
pt_br: $var = 'ciao'; $obj = (object) $var; echo $obj - scalar; / / imprime 'ciao'

source: Variables
pt_br: Variáveis

source: Chapter 8.
pt_br: Capítulo 8.

source: When a form is submitted to a PHP script, the information from that form is automatically made available to the script.
pt_br: Formulários HTML (GET and POST)

source: There are many ways to access this information, for example:
pt_br: Quando um formulário é submetido para um script PHP, qualquer variável do formulário será automaticamente disponível para o script.

source: Example 8-2.
pt_br: Há várias maneiras de acessar estas informações, por exemplo:

source: A simple HTML form
pt_br: Exemplo 8-1.

source: form action=" foo.php "method="post" Name: input type="text "name="username" br Email: input type="text "name="email" br input type="submit "name="submit" value="Submit me! "/ form
pt_br: form action=" foo.php "method="post" Nome: input type="text "name="username" br Email: input type="text "name="email" br input type="submit "name="submit" value="Me aperte! "/ form

source: Some examples are:
pt_br: Dependendo da configuração local e suas preferencias pessoais, essas são as vias pela qual você pode acessar os dados de seus formulários:

source: Example 8-3.
pt_br: Exemplo 8-2.

source: Accessing data from a simple POST HTML form
pt_br: Acessando dados de um formulário HTML via POST

source: As of / / PHP 4.2.0 the default value of register_globals = off. / / Using / relying on this method is not preferred. print $username;?
pt_br: ?php / / Disponível desde o PHP 4.1.0 print $_POST[ 'username']; print $_REQUEST['username']; import_request_variables('p', 'p_'); print $p_username; / / Disponível deste o PHP 3. print $HTTP_POST_VARS['username']; / / Disponível se a diretiva register_globals = on. / / Desde o PHP 4.2.0 o valor default de register_globals é off / / Usar / manter esse método é preferível. print $username;?

source: Using a GET form is similar except you 'll use the appropriate GET predefined variable instead.
pt_br: Utilizar um formulário GET é similar, exceto que você use a variável GET predefinida.

source: GET also applies to the QUERY_STRING (the information after the '?' in an URL).
pt_br: O metodo GET obtem os dados da QUERY_STRING (a informação depois do '?' numa URL).

source: So, for example, http: / /www.example.com / test.php?id=3 contains GET data which is accessible with $_GET[ 'id'].
pt_br: Então, por exemplo, http: / /www.example.com / test.php?id=3 contém os dados GET que serão acessíveis com $_GET[ 'id'].

source: See also $_REQUEST and import_request_variables().
pt_br: Veja também $_REQUEST e import_request_variables().

source: Superglobal arrays, like $_POST and $_GET, became available in PHP 4.1.0
pt_br: Arrays superglobais, como $_POST e $_GET, estão disponíveis desde o PHP 4.1.0.

source: As shown, before PHP 4.2.0 the default value for register_globals was on.
pt_br: Como explicado, antes do PHP 4.2.0 o valor default de register_globals era on.

source: And, in PHP 3 it was always on.
pt_br: E no PHP ele era sempre on.

source: The PHP community is encouraging all to not rely on this directive as it' s preferred to assume it's off and code accordingly.
pt_br: A comunidade PHP está encorajando todos a não alterarem essa diretiva, assumindo-a sempre como off e codificando em conformidade com isso.

source: The magic_quotes_gpc configuration directive affects Get, Post and Cookie values.
pt_br: A diretiva de configuração magic_quotes_gpc afeta os valores de GET, POST e Cookies.

source: If turned on, value (It's "PHP !") will automagically become (It\'s \"PHP!\").
pt_br: Se estiver ativada, o valor (It's "PHP !") se tornará automaticamente (It\'s \"PHP!\").

source: Escaping is needed for DB insertion.
pt_br: Escaping é necessário para inserção em bancos de dados.

source: See also addslashes(), stripslashes() and magic_quotes_sybase.
pt_br: Veja também addslashes(), stripslashes() e magic_quotes_sybase.

source: PHP also understands arrays in the context of form variables (see the related faq).
pt_br: O PHP entende arrays no contexto de variáveis de formulários (veja o FAQ O PHP entende arrays no contexto de variáveis de formulários (veja o FAQ relacionado).

source: You may, for example, group related variables together, or use this feature to retrieve values from a multiple select input.
pt_br: Você pode, por exemplo, agrupar variáveis relacionadas juntas, ou usar esse recurso para receber valores de um campo de seleção múltipla.

source: For example, let 's post a form to itself and upon submission display the data:
pt_br: Por exemplo, podemos ter um formulario que manda informações para si mesmo até um comando submetido para mostrar todos os dados.

source: Example 8-4.
pt_br: Exemplo 8-3.

source: More complex form variables
pt_br: Variáveis de formulários mais complexos

source: ?php if ($HTTP_POST_VARS['action'] == 'submitted') {print 'pre'; print_r($HTTP_POST_VARS); print 'a href="'. $HTTP_SERVER_VARS['PHP_SELF'] .' "Please try again / a'; print '/ pre';} else {? form action=" ?php echo $HTTP_SERVER_VARS['PHP_SELF'];? "method="post" Name: input type="text "name="personal[name]" br Email: input type="text "name="personal[email]" br Beer: br select multiple name="beer[] "option value="warthog" Warthog / option option value="guinness "Guinness / option option value="stuttgarter" Stuttgarter Schwabenbräu / option / select br input type="hidden "name="action" value="submitted "input type="submit" name="submit "value="submit me!" / form ?php}?
pt_br: No PHP 3, os arrays variáveis de formulários eram limitados a uma dimensão.

source: In PHP 3, the array form variable usage is limited to single-dimensional arrays.
pt_br: No PHP 4, essa restrição não existe mais.

source: In PHP 4, no such restriction applies.
pt_br: Nomes de variáveis SUBMIT IMAGE

source: When submitting a form, it is possible to use an image instead of the standard submit button with a tag like:
pt_br: Quando submetendo um formulário, é possível de se utilizar imagens ao invés do botão de submit padrão com uma tag do tipo:

source: When the user clicks somewhere on the image, the accompanying form will be transmitted to the server with two additional variables, sub_x and sub_y.
pt_br: Quando o usuário clica em algum lugar da imagem, o formulário que o acompanha é transmitido para o servidor com duas variáveis adicionais, sub_x e sub_y.

source: These contain the coordinates of the user click within the image.
pt_br: Eles contém a coordenadas do clique do usuário na imagem.

source: The experienced may note that the actual variable names sent by the browser contains a period rather than an underscore, but PHP converts the period to an underscore automatically.
pt_br: Cookies HTTP

source: PHP transparently supports HTTP cookies as defined by Netscape 's Spec.
pt_br: O PHP suporta transparentemente cookies HTTP como os definidos pela especificação da Netscape.

source: Cookies are part of the HTTP header, so the SetCookie function must be called before any output is sent to the browser.
pt_br: Cookies são parte do header HTTP, então, a função setcookie() precisa ser chamada antes de qualquer saída ser enviada ao browser.

source: This is the same restriction as for the header() function.
pt_br: Esta é a mesma restrição da função header().

source: Cookie data is then available in the appropriate cookie data arrays, such as $_COOKIE, $HTTP_COOKIE_VARS as well as in $_REQUEST.
pt_br: Dados de cookies são disponíveis nos arrays de dados de cookies apropriados, como $_COOKIE, $HTTP_COOKIE_VARS como também em $_REQUEST.

source: See the setcookie() manual page for more details and examples.
pt_br: Veja o manual de setcookie() para mais detalhes e exemplos.

source: ?php setcookie( "MyCookie[foo]", "Testing 1", time()+3600); setcookie("MyCookie[bar]", "Testing 2", time()+3600);?
pt_br: ?php setcookie( "MeuCookie[foo]", "Testando 1", time()+3600); setcookie("MeuCookie[bar]", "Testando 2", time()+3600);?

source: That will create two seperate cookies although MyCookie will now be a single array in your script.
pt_br: Isso irá criar dois cookies separados enquanto MeuCookie será um único array em seu script.

source: If you want to set just one cookie with multiple values, consider using serialize() or explode() on the value first.
pt_br: Se você quiser colocar em apenas um cookie vários valores, considere utilizar serialize() ou explode() nos valores primeiro.

source: Note that a cookie will replace a previous cookie by the same name in your browser unless the path or domain is different.
pt_br: Note que um cookie substituirá um anterior com o mesmo nome em seu browser mesmo se o nome ou o caminho for diferente.

source: So, for a shopping cart application you may want to keep a counter and pass this along. i.e.
pt_br: Então, para uma aplicação de carrinho de compras em que você quer ter um contador e repassá-lo:

source: Example 8-5.
pt_br: Exemplo 8-4.

source: A setcookie() example
pt_br: Exemplo setcookie()

source: ?php $count++; setcookie("count", $count, time()+3600); setcookie("Cart[$count]", $item, time()+3600);?
pt_br: Pontos em nomes de variáveis postadas

source: Typically, PHP does not alter the names of variables when they are passed into a script.
pt_br: Normalmente o PHP não altera o nome de variáveis quando elas são passadas para o script.

source: However, it should be noted that the dot (period, full stop) is not a valid character in a PHP variable name.
pt_br: Entretanto, é necessário notar que o ponto (ponto final) não é um caracter válido no nomes de variáveis do PHP.

source: For the reason, look at it:
pt_br: Para ilustrar, veja o seguinte exemplo:

source: ?php $varname.ext; / * invalid variable name * /?
pt_br: ?php $varname.ext; / * nome de variável inválido * /?

source: For this reason, it is important to note that PHP will automatically replace any dots in incoming variable names with underscores.
pt_br: Nessa situação, é importante saber que o PHP automaticamente substituirá qualquer ponto nos nomes de variáveis recebidas com sublinhados.

source: Because PHP determines the types of variables and converts them (generally) as needed, it is not always obvious what type a given variable is at any one time.
pt_br: Porque o PHP determina os tipos de variáveis e faz conversões (geralmente) quando necessárias, nem sempre é óbvio o tipo de uma variável tem em todos os momentos.

source: PHP includes several functions which find out what type a variable is, such as: gettype(), is_array(), is_float(), is_int(), is_object(), and is_string().
pt_br: O PHP incluí várias funções que permitem determinar qual o tipo de uma variável, por exemplo: gettype(), is_array(), is_float(), is_int(), is_object(), e is_string().

source: See also the chapter on Types.
pt_br: Veja também o capítulo Tipos.

source: Variable variables
pt_br: Variáveis variáveis

source: Variables in PHP are represented by a dollar sign followed by the name of the variable.
pt_br: Capítulo 8.

source: The variable name is case-sensitive.
pt_br: Variáveis

source: Variable names follow the same rules as other labels in PHP.
pt_br: Introdução

source: A valid variable name starts with a letter or underscore, followed by any number of letters, numbers, or underscores.
pt_br: As variáveis no PHP são representadas por um cifrão ($) seguido pelo nome da variável.

source: ?php $var = "Bob"; $Var = "Joe"; echo "$var, $Var"; / / outputs "Bob, Joe" $4site = 'not yet'; / / invalid; starts with a number $_4site = 'not yet'; / / valid; starts with an underscore $täyte = 'mansikka'; / / valid; 'ä 'is ASCII 228.?
pt_br: Em uma expressão regular isto poderia ser representado desta forma: '[a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff]*'

source: In PHP 3, variables are always assigned by value.
pt_br: Nota:

source: That is to say, when you assign an expression to a variable, the entire value of the original expression is copied into the destination variable.
pt_br: Para nossos propósitos, as letras a-z, A-Z e os caracteres ASCII de 127 a 255 (0x7f-0xff).

source: For more information on this kind of assignment, see the chapter on Expressions.
pt_br: ?php $var = "Bob"; $Var = "Joe"; echo "$var, $Var"; / / exibe "Bob, Joe" $4site = 'not yet'; / / inválido; começa com um número $_4site = 'not yet'; / / válido; começa com um sublinhado $täyte = 'mansikka'; / / válido; 'ä 'é um caracter ASCII 228.?

source: PHP 4 offers another way to assign values to variables: assign by reference.
pt_br: No PHP 3, as variáveis são sempre atribuídas por valor.

source: This means that the new variable simply references (in other words, "becomes an alias for "or "points to") the original variable.
pt_br: Isto significa que quando você atribui uma expressão a uma variável, o valor da expressão original é copiado integralmente para a variável de destino.

source: Changes to the new variable affect the original, and vice versa.
pt_br: Isto significa também que, após atribuir o valor de uma variável a outra, a alteração de uma destas variáveis não afetará a outra.

source: This also means that no copying is performed; thus, the assignment happens more quickly.
pt_br: Para maiores informações sobre este tipo de atribuição, veja o capítulo em Expressões.

source: However, any speedup will likely be noticed only in tight loops or when assigning large arrays or objects.
pt_br: O PHP 4 oferece um outro meio de atribuir valores a variáveis: a atribuição por referência.

source: To assign by reference, simply prepend an ampersand () to the beginning of the variable which is being assigned (the source variable).
pt_br: Isto significa que a nova variável simplesmente referencia (em outras palavras, "torna-se um apelido para "ou "aponta para") a variável original.

source: For instance, the following code snippet outputs' My name is Bob 'twice:
pt_br: Alterações na nova variável afetam a original e vice versa.

source: One important thing to note is that only named variables may be assigned by reference.
pt_br: Entretanto, qualquer aumento de velocidade só será realmente notado em *loops* complexos ou em atribuições de grandes arrays ou objetos.

source: ?php $foo = 25; $bar = $foo; / / This is a valid assignment. $bar = (24 * 7); / / Invalid; references an unnamed expression. function test() {return 25;} $bar = test(); / / Invalid.?
pt_br: Para atribuir por referência, simplesmente adicione um e-comercial () na frente do nome da variável que estiver sendo atribuída (variável de origem) Por exemplo, o trecho de código abaixo imprime 'My name is Bob 'duas vezes:

source: For example, in Perl 'Z'+1 turns into'AA', while in C'Z'+1 turns into '[' {ord('Z') == 90, ord('[') == 91).
pt_br: ?php $foo = 'Bob'; / / Atribui o valor 'Bob' a variável $foo $bar = $foo; / / Referecia $foo através de $bar. $bar = "My name is $bar"; / / Altera $bar... echo $bar; echo $foo; / / $foo é alterada também.?

source: Arithmetric Operations on Character Variables
pt_br: Uma observação importante a se fazer: somente variáveis nomeadas podem ser atribuídas por referência.

source: X Y Z AA AB AC * /?
pt_br: ?php $foo = 25; $bar = $foo; / / Esta atribuição é válida. $bar = (24 * 7); / / Inválido; referencia uma expressão sem nome. function test() {return 25;} $bar = test(); / / Inválido.?

source: Predefined variables
pt_br: Variáveis Predefinidas

source: PHP provides a large number of predefined variables to any script which it runs.
pt_br: O PHP oferece um grande número de variáveis predefinidas para qualquer script que ele execute.

source: Many of these variables, however, cannot be fully documented as they are dependent upon which server is running, the version and setup of the server, and other factors.
pt_br: Muitas destas variáveis, entretanto, não podem ser completamente documentadas uma vez dependem de diversos fatores, como o servidor no qual scripts são executados, a versão e configuração deste servidor e outros.

source: Some of these variables will not be available when PHP is run on the command line.
pt_br: Algumas destas variáveis não estarão disponíveis quando o PHP for executado na linha de comando.

source: For a listing of these variables, please see the section on Reserved Predefined Variables.
pt_br: Para uma lista destas variáveis, veja a seção Variáveis reservadas.

source: In PHP 4.2.0 and later, the default value for the PHP directive register_globals is off.
pt_br: No PHP 4.2.0 e posteriores, o valor default da diretiva register_globals é off.

source: This is a major change in PHP.
pt_br: Esta é a maior modificação no PHP.
